{
  "r3_version": "1.0",
  "id": "shrimp-etouffee-hank-shaw-2024-11-18",
  "title": "Shrimp Étouffée",
  "description": "Classic Cajun shrimp étouffée with an optional homemade shrimp stock and a flour-and-oil roux. Serves 4–6.",
  "author": "Hank Shaw",
  "last_updated": "2024-11-18",
  "ratings": {
    "count": 40,
    "average": null
  },
  "times": {
    "prep_minutes": 20,
    "cook_minutes": 35,
    "optional_stock_minutes": 45,
    "total_minutes": 100
  },
  "yields": {
    "servings": "4 to 6"
  },
  "ingredients": {
    "shrimp_stock": [
      "Shells from 2 pounds of shrimp",
      "1/2 large onion, chopped",
      "Top and bottom from 1 green pepper",
      "2 garlic cloves, chopped",
      "1 celery rib, chopped",
      "5 bay leaves",
      "2 quarts water (for simmering stock)"
    ],
    "etouffee": [
      "1/4 cup vegetable oil or lard",
      "1/4 heaping cup flour",
      "1 large rib celery, chopped",
      "1 green bell pepper, chopped",
      "1 to 2 jalapeño peppers, chopped",
      "1/2 large onion, chopped",
      "4 garlic cloves, chopped",
      "1 pint shrimp stock, clam juice, or fish stock (about 2 cups)",
      "1 tablespoon Cajun seasoning",
      "1/2 teaspoon celery seed",
      "1 tablespoon sweet paprika",
      "Salt, to taste",
      "2 pounds shrimp, peeled (save the shells for shrimp stock)",
      "3 green onions, chopped",
      "Hot sauce (Crystal or Tabasco), to taste",
      "Cooked white rice, for serving (not listed in original ingredients but recommended)"
    ]
  },
  "method": [
    {
      "section": "Make the optional shrimp stock",
      "steps": [
        "If you don't already have prepared stock, pour 2 quarts of water into a pot and add all the shrimp stock ingredients.",
        "Bring to a boil, drop the heat and simmer gently for 45 minutes.",
        "Strain through a fine-meshed sieve into another pot set over low heat.",
        "You will only need about 2 cups of stock for this recipe; save leftovers for other dishes. Refrigerate up to 1 week or freeze up to 3 months."
      ]
    },
    {
      "section": "Make the roux",
      "steps": [
        "Heat the vegetable oil or lard in a heavy pot over medium heat for 1 to 2 minutes.",
        "Stir in the flour, making sure there are no clumps. Cook, stirring often, until it turns a very brown color, about 10 minutes."
      ]
    },
    {
      "section": "Add the vegetables",
      "steps": [
        "Add the celery, green pepper, jalapeño and onion; mix well and cook over medium heat for 4 minutes, stirring occasionally.",
        "Add the garlic and cook another 2 minutes."
      ]
    },
    {
      "section": "Add stock, seasonings, and shrimp",
      "steps": [
        "Measure out about 2 cups of shrimp stock (or clam juice or fish stock). Slowly add it a little at a time, stirring constantly so it incorporates.",
        "The roux will absorb the stock and seize up at first, then loosen—add additional stock as needed to make a sauce about the thickness of syrup.",
        "Add the Cajun seasoning, celery seed and paprika and mix well.",
        "Add salt to taste, then mix in the peeled shrimp.",
        "Cover the pot, turn the heat to its lowest setting and cook for 10 minutes."
      ]
    },
    {
      "section": "Finish and serve",
      "steps": [
        "Add the chopped green onions and hot sauce to taste.",
        "Serve the étouffée over white rice with a cold beer or lemonade (optional)."
      ]
    }
  ],
  "techniques_and_tips": [
    "Étouffée means 'smothered'—cook the protein in a flavorful sauce rather than braising or quick sautéing.",
    "Roux: cook the flour/oil mixture to a very brown color for deep flavor—stir often and monitor closely to avoid burning.",
    "If using pre-made stock, prep time reduces substantially (approx. 20 minutes total).",
    "Leftover shrimp stock can be used for soups, risotto, or other seafood dishes."
  ],
  "notes": [
    "There is debate about whether étouffée must contain a roux, tomato, or multiple seafoods; this version uses a brown roux, a single seafood (shrimp), Tabasco-style hot sauce, and no tomato.",
    "The recipe lists 'optional homemade stock' which requires extra time but significantly deepens flavor."
  ],
  "tags": [
    "Cajun",
    "Creole",
    "Shrimp",
    "Stew",
    "Mardi Gras",
    "Southern"
  ],
  "source": {
    "provenance": "Converted from uploaded text file.",
    "file_reference": "file-Yav9a6PF7LSApCa2YVV7PN"
  },
  "original_text_excerpt": "Shrimp Étouffée — Our recipe for this classic Cajun stew includes homemade shrimp stock, giving it a full flavor... (original file attached).",
  "copyright_and_credits": {
    "credit_line": "By Hank Shaw — converted from uploaded file",
    "original_file_citation": "file-Yav9a6PF7LSApCa2YVV7PN"
  },
  "nutrition": null
}